# Origin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..Origin Property
FabricationPart Class See Also
---
The origin of the fabrication part element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ Origin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Origin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Origin {
	XYZ^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace